In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['harry', 'rohan', 'skillf', 'Wasim'],
    "marks": [25, 23, 19, 29],
    "City": ["Mumbai", "hyderabad", "scanf", "Pune"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       City
0   harry     25     Mumbai
1   rohan     23  hyderabad
2  skillf     19      scanf
3   Wasim     29       Pune

In [5]:
df.to_csv("dataframecsv.csv")

In [6]:
df.to_csv("dataframecsv_noIndex.csv", index=False)

In [7]:
df.head(2)

    name  marks       City
0  harry     25     Mumbai
1  rohan     23  hyderabad

In [8]:
df.tail(2)

     name  marks   City
2  skillf     19  scanf
3   Wasim     29   Pune

In [9]:
df.describe()

           marks
count   4.000000
mean   24.000000
std     4.163332
min    19.000000
25%    22.000000
50%    24.000000
75%    26.000000
max    29.000000

In [10]:
marks = pd.read_csv("marks.csv")

In [11]:
marks

   Unnamed: 0    name  marks       City
0           0   harry     30     Mumbai
1           1   rohan     23  hyderabad
2           2  skillf     19      scanf
3           3   Wasim     29       Pune

In [12]:
marks["marks"][0]

np.int64(30)

In [13]:
marks["marks"][0] = 30

C:\Users\Wasim Shaikh\AppData\Local\Temp\ipykernel_14912\663171420.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  marks["marks"][0] = 30
C:\Users\Wasim Shaikh\AppData\Local\Temp\ipykernel_14912\663171420.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  marks["marks"][0] = 30

In [14]:
marks["marks"][0]

np.int64(30)

In [15]:
marks.to_csv("marks.csv")

In [16]:
marks.index = [1, 2, 3, 4]

In [17]:
marks

   Unnamed: 0    name  marks       City
1           0   harry     30     Mumbai
2           1   rohan     23  hyderabad
3           2  skillf     19      scanf
4           3   Wasim     29       Pune

In [21]:
ser = pd.Series(np.random.rand(30))

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
ser

0     0.890453
1     0.668212
2     0.990735
3     0.544008
4     0.734878
5     0.972450
6     0.417142
7     0.248408
8     0.329900
9     0.608752
10    0.196191
11    0.392140
12    0.233313
13    0.509437
14    0.636988
15    0.687372
16    0.288548
17    0.939230
18    0.918494
19    0.398950
20    0.663676
21    0.919666
22    0.526125
23    0.241301
24    0.583414
25    0.831448
26    0.508350
27    0.023194
28    0.476637
29    0.995100
dtype: float64

In [26]:
newdf = pd.DataFrame(np.random.rand(333, 5), index=np.arange(333))

In [27]:
newdf

            0         1         2         3         4
0    0.934235  0.876960  0.421355  0.612144  0.987124
1    0.841003  0.612524  0.605219  0.080467  0.032492
2    0.912482  0.996750  0.091752  0.557149  0.225137
3    0.880328  0.605931  0.313092  0.092681  0.070025
4    0.404324  0.378573  0.574015  0.569214  0.400450
..        ...       ...       ...       ...       ...
328  0.590880  0.818281  0.780489  0.023545  0.481152
329  0.194309  0.836805  0.940476  0.587890  0.622143
330  0.810662  0.671575  0.711622  0.906735  0.531268
331  0.285260  0.893430  0.340081  0.654289  0.960814
332  0.736665  0.648636  0.624264  0.275613  0.501901

[333 rows x 5 columns]